app/Services/BookService.php

    public function listBooks()
    {
        $page = request('page', 1);
        $cacheKey = self::BOOKS_CACHE_KEY . '_page_' . $page;
        return Cache::remember($cacheKey, 60 * 60, function () {
            return Book::with('genres:id,genre')->paginate(10);
        });
---
select * from `books` where `books`.`deleted_at` is null

    public function createBook(array $data)
    {
        $genres = $data['genres'] ?? [];
        unset($data['genres']);
        $book = Book::create($data);
        if (!empty($genres)) {
            $book->genres()->sync($genres);
        }
        Cache::forget(self::BOOKS_CACHE_KEY);
        return $book->load('genres:id,genre');
---
insert into `books` (`name`, `author`, `registration_number`, `status`, `id`, `updated_at`, `created_at`) values ('Livro teste', 'Testador', '963258', 'available', '3f998a29-27fd-467a-a924-9d560dfa0674', '2025-07-16 20:49:44', '2025-07-16 20:49:44')
insert into `book_genre` (`book_id`, `genre_id`) values ('3f998a29-27fd-467a-a924-9d560dfa0674', 'f960b1a8-0af5-4be2-b6f2-b409618e479c')
select * from `book_genre` where `book_genre`.`book_id` = '3f998a29-27fd-467a-a924-9d560dfa0674'

    public function deleteBook(string $book)
    {
        $book = Book::findOrFail($book);
        $book->delete();
---
select * from `books` where `books`.`id` = 'c2fa40c8-1b17-490d-8627-3e4d155f8a5f' and `books`.`deleted_at` is null limit 1
update `books` set `deleted_at` = '2025-07-16 20:49:50', `books`.`updated_at` = '2025-07-16 20:49:50' where `id` = 'c2fa40c8-1b17-490d-8627-3e4d155f8a5f'