app/Services/GenreService.php

select * from `genres` where `genres`.`deleted_at` is null
---
    public function listGenres()
    {
        $page = request('page', 1);
        $cacheKey = self::GENRES_CACHE_KEY . '_page_' . $page;
        return Cache::remember($cacheKey, 60 * 60, function () {
            return Genre::paginate(10);
        });

select exists(select * from `genres` where `genre` = 'Comedia Romatica' and `genres`.`deleted_at` is null) as `exists`
insert into `genres` (`genre`, `id`, `updated_at`, `created_at`) values ('Comedia Romatica', '69cb23e2-3fac-4ce0-a8d7-728249608ad5', '2025-07-16 20:42:22', '2025-07-16 20:42:22')
---
    public function createGenre(array $data)
    {

        if (empty($data['genre']))
            throw new \InvalidArgumentException('O nome do gênero é obrigatório.');

        if (Genre::where('genre', $data['genre'])->exists())
            throw new \Exception('Já existe um gênero com este nome.');

        $genre = Genre::create($data);

select exists(select * from `genres` where `genre` = 'Terror - Suspense' and `id` != 'f960b1a8-0af5-4be2-b6f2-b409618e479c' and `genres`.`deleted_at` is null) as `exists`
update `genres` set `genre` = 'Terror - Suspense', `genres`.`updated_at` = '2025-07-16 20:49:15' where `id` = 'f960b1a8-0af5-4be2-b6f2-b409618e479c'
---
    public function updateGenre(Genre $genre, array $data)
    {

        if (isset($data['genre']) && empty($data['genre'])) {
             throw new \InvalidArgumentException('O nome do gênero não pode ser vazio.');
        }


        if (isset($data['genre']) && Genre::where('genre', $data['genre'])->where('id', '!=', $genre->id)->exists()) {
            throw new \Exception('Já existe outro gênero com este nome.');
        }

        $genre->update($data);

select * from `genres` where `genres`.`id` = '1645a7ac-893e-4c30-bfd7-3fe94ae0cec1' and `genres`.`deleted_at` is null limit 1
update `genres` set `deleted_at` = '2025-07-16 20:45:29', `genres`.`updated_at` = '2025-07-16 20:45:29' where `id` = '1645a7ac-893e-4c30-bfd7-3fe94ae0cec1'
---
    public function deleteGenre(Genre $idGenre)
    {
        $genre = Genre::findOrFail($idGenre->id);
        $genre->delete();