app/Services/LoanService.php

select * from `loans`
select * from `books` where `books`.`id` in ('c2fa40c8-1b17-490d-8627-3e4d155f8a5f') and `books`.`deleted_at` is null
select * from `users` where `users`.`id` in (754) and `users`.`deleted_at` is null
---
    public function listLoans()
    {
        return Cache::remember(self::LOANS_CACHE_KEY, 60 * 60, function () {
            return Loan::with(['user', 'book'])->get();
        });

select * from `books` where `books`.`id` = 'a53541fd-1723-414d-a541-66af7dfa886d' and `books`.`deleted_at` is null limit 1
insert into `loans` (`user_id`, `book_id`, `status`, `devolution_date`, `id`, `updated_at`, `created_at`) values ('a88a5ebe-4327-4e9b-8a86-dcd51cf030c3', 'a53541fd-1723-414d-a541-66af7dfa886d', 'pending', '2025-07-24 00:00:00', 'f706ac0d-419c-4b15-b516-9e0ca50c2dee', '2025-07-16 20:47:51', '2025-07-16 20:47:51')
update `books` set `status` = 'borrowed', `books`.`updated_at` = '2025-07-16 20:47:51' where `id` = 'a53541fd-1723-414d-a541-66af7dfa886d'
select * from `books` where `books`.`id` in ('a53541fd-1723-414d-a541-66af7dfa886d') and `books`.`deleted_at` is null
select * from `users` where `users`.`id` in (0) and `users`.`deleted_at` is null
---
    public function createLoan(array $data)
    {
        $book = Book::find($data['book_id']);
        $userId = request()->user()?->id;

        if (!$book) {
            throw new \Exception('Livro não encontrado.');
        }

        if ($book->status === 'borrowed') {
            throw new \Exception('Livro não disponível para empréstimo.');
        }

        if($userId === $book->user_id) {
            throw new \Exception('Usuário proprietário do livro.');
        }

        $loan = Loan::create($data);

        $book->status = 'borrowed';
        $book->save();

        Cache::forget(self::LOANS_CACHE_KEY);
        return $loan->load('user', 'book');

update `loans` set `status` = 'returned', `loans`.`updated_at` = '2025-07-16 20:41:56' where `id` = '921f246b-cfc6-4336-b57b-dc54ffe09549'
---
    public function updateLoan(Loan $loan, array $data)
    {
        $loan->update($data);