app/Services/UserService.php

    public function listUser()
    {
        $page = request('page', 1);
        $cacheKey = self::USERS_CACHE_KEY . '_page_' . $page;
        return Cache::remember($cacheKey, 60 * 60, function () {
            return User::paginate(10);
        });
---
select * from `users` where `users`.`deleted_at` is null

    public function createUser(array $data)
    {

        if (User::where('email', $data['email'])->exists())
            throw new \Exception('Já existe um usuário cadastrado com este e-mail.');


        if (User::where('registration_number', $data['registration_number'])->exists())
            throw new \Exception('Já existe um usuário cadastrado com este número de matrícula.');


        $user = User::create($data);
---
select exists(select * from `users` where `email` = 'edu@gmail.com' and `users`.`deleted_at` is null) as `exists`
select exists(select * from `users` where `registration_number` = '987654' and `users`.`deleted_at` is null) as `exists`
insert into `users` (`name`, `email`, `registration_number`, `password`, `id`, `updated_at`, `created_at`) values ('Novo usuário', 'edu@gmail.com', '987654', '123456', 'eb1b2b28-2899-40c6-840a-698b8a21da42', '2025-07-16 20:48:49', '2025-07-16 20:48:49')